In [1]:
# import all the required python libraries      
import numpy as np 
import pandas as pd

In [2]:
#import daataset
df = pd.read_csv("iris.csv")

In [3]:
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [4]:
#data preprocessing
df.isnull().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     0
variety         0
dtype: int64

In [5]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

describe() gives summary statistics of each column
it includes 25th/75th percentile, maximum valuemean, etc.

25%: the 25th percentile (also known as the first quartile), which is the value below which 25% of the values in the column fall
50%: the 50th percentile (also known as the median), which is the value below which 50% of the values in the column fall
75%: the 75th percentile (also known as the third quartile), which is the value below which 75% of the values in the column fall

Note that describe() only works for numeric columns (i.e., columns with integer or floating-point values). If a column contains non-numeric values (e.g., strings), describe() will return only the count, unique, top, and freq statistics.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

info() is a pandas function that provides a summary of a dataframe, including the column names, data types, and number of non-null values for each column. It also provides the total number of rows in the dataframe.

In [7]:
df.shape

(150, 5)

In [8]:
df.size

750

returns the total number of elements in a dataframe

In [9]:
#Data Formatting and Normalization
df.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [11]:
#converting categorical variables into quantitative variables
#In order to turn categorical variables into quantitative variables in Python, we can use various techniques depending on the type of categorical variable.In the case of nominal categorical variables (where there is no inherent ordering of categories), we can use one-hot encoding or dummy variables. This involves creating a binary indicator variable for each category in the original variable.
df=pd.get_dummies(df,columns=['variety'])

In [12]:
df.sample(5)

,sepal.length,sepal.width,petal.length,petal.width,variety_Setosa,variety_Versicolor,variety_Virginica
101,5.8,2.7,5.1,1.9,0,0,1
54,6.5,2.8,4.6,1.5,0,1,0
12,4.8,3.0,1.4,0.1,1,0,0
19,5.1,3.8,1.5,0.3,1,0,0
144,6.7,3.3,5.7,2.5,0,0,1

In [13]:
df1=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':['a','b','c','d','e'],
    'C':[1.1,1.2,1.3,1.4,1.5],
    'D':[True,False,True,False,True]})

In [15]:
df1.head()

   A  B    C      D
0  1  a  1.1   True
1  2  b  1.2  False
2  3  c  1.3   True
3  4  d  1.4  False
4  5  e  1.5   True

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      object
 2   C       5 non-null      float64
 3   D       5 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 253.0+ bytes

In [17]:
df1.dtypes

A      int64
B     object
C    float64
D       bool
dtype: object

In [18]:
df1.describe()

              A         C
count  5.000000  5.000000
mean   3.000000  1.300000
std    1.581139  0.158114
min    1.000000  1.100000
25%    2.000000  1.200000
50%    3.000000  1.300000
75%    4.000000  1.400000
max    5.000000  1.500000

In [19]:
df1.isnull().sum()

A    0
B    0
C    0
D    0
dtype: int64

In [20]:
df1.shape

(5, 4)